# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 10 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone

  # - [-1, 1, ACmix, [512]]
backbone:

  - [-1, 1, LOGStem, [128]] # 0
  - [-1, 1, GDCM, [128]] # 1
  - [ -1, 1, Down, [ 256 ] ]
  - [-1, 1, GDCM, [256]] # 3
  - [ -1, 1, Down, [ 512 ] ]
  - [-1, 1, GDCM_button, [512]] # 5
  - [-1, 1,Pzconv,[512]]
  - [-1, 1, SPPF, [512, 5]] # 7
  
head:
  - [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ]
  - [ [ -1, 3 ], 1, Concat,[ 1 ] ]
  - [ -1, 3, C2f, [ 256 ] ] # 10

  - [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ]
  - [ [ -1, 1 ], 1, Concat, [ 1 ] ]
  - [ -1, 3, C2f, [ 128 ] ] # 13
 
  - [ -1, 1, Down, [ 256 ] ]
  - [ [ -1, 10 ], 1, Concat, [ 1 ] ]
  - [ -1, 3, C2f, [ 256 ] ]

  - [ -1, 1, Down, [ 512 ] ]
  - [ [ -1, 7 ], 1, Concat, [ 1 ] ]
  - [ -1, 3, C2f, [ 512] ]


  - [ [16, 19 ], 1, Detect, [ nc ] ]  # Detect(P3, P4, P5)